export const data = [
  {
    header: "Какой вклад я могу внести в работу команды:",
    questions: [
      "Я быстро выясняю, что сработает в данной ситуации, если в подобную ситуацию я уже попадал.", // g
      "Моим достоинством является умение находить людей, способных принести пользу команде.", // d
      "Я готов перенести временную непопулярность, если вижу, что мои действия принесут в конечном счете полезные результаты.", // f
      "Генерация идей — моё врожденное достоинство.", // c
      "Я думаю, что способен быстро замечать новые возможности и извлекать из них выгоды.", // a
      "Личные заблуждения и предубеждения не мешают мне находить и доказывать преимущества альтернативных действий.", // h
      "Я могу успешно работать с самыми разными людьми.", // b
      "Моя способность доводить всё до конца во многом обеспечила мою профессиональную эффективность.", //e
    ],
  },
  {
    header: "Мои недостатки, которые могут проявиться в командной работе:",
    questions: [
      "Я чувствую себя неуверенно на совещании, если отсутствуют четкая повестка дня и контроль за её соблюдением.", // a
      "Я склонен быть слишком великодушным к людям, имеющим правильную точку зрения, но не высказывающим её открыто.", // b
      "Я иногда выгляжу авторитарным и нетерпимым, когда чувствую необходимость достичь чего-то.", // e
      "Я слишком захвачен идеями, которые мне приходят в голову, и поэтому плохо слежу за тем, что происходит вокруг.", // g
      "Я склонен слишком много говорить, когда в группе обсуждаются новые идеи.", // c
      "Вследствие моей осмотрительности я не склонен быстро и с энтузиазмом присоединяться к мнению коллег.", // d
      "Мне трудно повести людей за собой, поскольку я слишком подвержен влиянию атмосферы, царящей в группе.", // f
      "Мои коллеги находят, что я слишком много внимания уделяю деталям и чрезмерно беспокоюсь о том, что дела идут неправильно.", // h
    ],
  },
  {
    header: "Участие в совместном проекте:",
    questions: [
      "На меня можно возложить обязанности следить за тем, чтобы наиболее существенная работа была организована должным образом.", //h
      "Я умею влиять на людей, не оказывая на них давления.", // a
      "Я готов оказать давление, чтобы совещание не превращалось в пустую трату времени и не терялась из виду основная цель обсуждения.", // c
      "Можно рассчитывать на поступление от меня оригинальных предложений.", // d
      "Я энергично ищу среди новых идей и разработок свежайшие.", // f
      "Я надеюсь, что моя способность выносить беспристрастные суждения признаётся всеми, кто меня знает.", // g
      "Я всегда готов поддержать любое предложение, если оно служит общим интересам.", // e
      "Врожденная осмотрительность предохраняет меня от ошибок, возникающих из-за невнимательности.", // b
    ],
  },
  {
    header: "Особенности моего стиля работы в команде:",
    questions: [
      "Я полагаю, что обладаю талантом быстро организовать исполнение одобренных планов.", // d
      "Я способен воспринимать любые высказываемые мнения, но без колебаний подчиняюсь мнению большинства после принятия решения.", //h
      "Я неохотно возражаю своим коллегам и не люблю сам быть в меньшинстве.", // b
      "Я обладаю способностью избегать очевидных решений и умею находить неожиданные.", // e
      "Я умею устанавливать контакты с внешним окружением команды.", // g
      "Я обычно нахожу вескую аргументацию против плохих предложений.", // c
      "Я постоянно стараюсь лучше узнать своих коллег.", // a
      "Я стремлюсь добиться совершенства при исполнении любой роли в командной работе.", // f
    ],
  },
  {
    header: "Я получаю удовлетворение от работы, потому что:",
    questions: [
      "Мне нравится находить практические решения проблем.", // b
      "Я способен добиться согласия людей на реализацию необходимого курса действий.", // f
      "Я способен оказывать сильное влияние на принятие решений.", // d
      "Мне нравится находить задачи, требующие напряжения воображения.", // h

      "Я получаю возможность встретиться с людьми, способными предложить что-то новое для меня.", // e
      "Мне доставляет удовольствие анализ ситуаций и взвешивание всех шансов.", // a
      "Мне нравится сознавать, что я создаю хорошие рабочие взаимоотношения.", // c
      "Я чувствую себя в своей стихии, когда могу уделить задаче все мое внимание.", // g
    ],
  },
  {
    header:
      "Если мне неожиданно предложат решить трудную задачу за ограниченное время с незнакомыми людьми, то:",
    questions: [
      "Я бы упорно добивался достижения цели, несмотря ни на какие помехи.", // f
      "Я бы попытался найти способ разбиения задачи на части в соответствии с тем, что лучше всего умеют делать отдельные члены команды.", // c
      "Я был бы готов действовать силой положительного примера при появлении признаков отсутствия прогресса в командной работе.", // g
      "Я бы почувствовал необходимость сначала в одиночестве обдумать пути выхода из тупика, прежде чем начать действовать.", // a
      "Я бы организовал дискуссию, чтобы стимулировать выдвижение новых идей и придать начальный импульс командной работе.", // h
      "Я надеюсь, мне бы удалось сохранить хладнокровие и способность логически мыслить.", // e
      "Я был бы готов работать с человеком, указавшим наиболее позитивный подход, каковы бы ни были связанные с этим трудности.", // b
      "Присущая мне обязательность помогла бы нам не отстать от графика.", // d
    ],
  },
  {
    header: "Проблемы, с которыми я сталкиваюсь, работая в команде:",
    questions: [
      "Я тяжел на подъем, если не имею ясных целей.", // e
      "Я стесняюсь обратиться за помощью к другим, когда не могу что-либо сделать сам.", // g
      "Я склонен проявлять нетерпимость по отношению к людям, мешающим, по моему мнению, прогрессу в делах группы.", // a
      "Мне иногда бывает очень трудно разобраться во встретившихся мне сложностях.", // f
      "Я слишком быстро утрачиваю энтузиазм и стараюсь почерпнуть его у наиболее активных членов группы.", // d
      "Окружающие иногда критикуют меня за чрезмерный рационализм и неспособность к интуитивным решениям.", // b
      "Я испытываю затруднения при обосновании своей точки зрения, когда сталкиваюсь с серьезными возражениями.", // h
      "Мое стремление обеспечить условия, чтобы работа выполнялась правильно, может приводить к снижению темпов.", // c
    ],
  },
];
export const text =
  "В каждой из семи частей данного теста распределите 10 баллов между 8 утверждениями. Если вы согласны с каким-либо утверждением на все 100%, вы можете отдать ему все 10 баллов.Рекомендуем распределять баллы 5/3/2 для достоверности результата.По результатам прохождения теста будет определена ваша роль в команде.";
export const roles = {
  executor: 0,
  chairman: 0,
  shaper: 0,
  thinker: 0,
  scout: 0,
  evaluating: 0,
  collectivist: 0,
  finisher: 0,
};
