export const data = [
  "Я думаю, что способен быстро замечать новые возможности и извлекать из них выгоды",
  "Я могу успешно работать с самыми разными людьми",
  "Генерация идей - моё врожденное достоинство",
  "Моим достоинством явдяется умение находить людей, способных принести пользу команде",
  "Моя способность доводить всё до конца во многом обеспечила мою профессиональную эффективность",
  "Я готов перенести временную непопулярность, если вижу, что мои действия принесут в конечном счете полезные результаты",
  "Я быстро выясняю, что сработает в данной ситуации, если в подобную ситуацию я уже попадал",
];
